// 仪表盘详情
// 入参
const params = {
  id: 1,
};
// 出参
const result = {
  code: 200,
  msg: 'success',
  data: {
    id: 1,
    name: '仪表盘1',
    description: '仪表盘1描述',
  },
};

// 图表详情
// 入参
const params1 = {
  id: 1,
};
// 出参
const result1 = {
  code: 200,
  msg: 'success',
  data: {
    type: 'bar',
    data: [
      ['1', '142518', '1346453'],
      ['2', '116082', '1062142'],
      ['3', '267347', '2478585'],
      ['4', '247476', '2300367'],
      ['5', '263643', '2504843'],
      ['6', '263296', '2517989'],
      ['7', '274594', '2574354'],
      ['8', '258912', '2381640'],
      ['9', '517788', '4760616'],
      ['10', '309376', '2792426'],
      ['11', '556048', '5010729'],
      ['12', '530036', '4948342'],
    ],
  },
};

// 筛选条件
// 入参
const params2 = { key: 'area' };
// 出参
const result2 = {
  code: 200,
  msg: 'success',
  data: [
    {
      id: 'west',
      name: '西部',
    },
    {
      id: 'east',
      name: '东部',
    },
    {
      id: 'middle',
      name: '中部',
    },
    {
      id: 'north',
      name: '北部',
    },
    {
      id: 'south',
      name: '南部',
    },
  ],
};
